{
  "navigation": {
    "language": "English",
    "navItem1": "Our company",
    "navItem2": "Products and Services",
    "navItem3": "Collaborating Companies",
    "navItem4": "Contact",
    "navItem5": "Announcements"
  },
  "language": {
    "english": "English",
    "greek": "Greek",
    "italian": "Italian"
  },
  "motivate": {
    "slide1": "We create together.\n\nFor what you love the most.",
    "hospital-title": "HEALTH INSURANCE",
    "hospital": "Health, the most valuable asset.",
    "home-title": "HOME INSURANCE",
    "home": "Your home, the next thing\nyou love the most, after your family",
    "family-title": "FAMILY INSURANCE",
    "family": "An act of love and responsibility,\nsecurity for your family",
    "vehicle-title": "VEHICLE INSURANCE",
    "vehicle": "Insure your vehicle with us"
  },
  "company": {
    "about": "Efthymiou Athanasios - Insurance Group was founded in 1991 with the purpose of making your life easier by providing insurance services.",
    "header": "What makes us special and what is your gain.",
    "item1": "Security, liability and trust since 1991.",
    "item2": {
      "row1": "We are collaborating with companies that provide insurance services ",
      "row2": "with the majority of them enlistig on the 'Fortune 500' and they address to ",
      "row3": "over 200 million clients worldwide."
    },
    "item3": {
      "row1": "Our clients trust us because we support them in time of need.",
      "row2": "We attend their finnancial needs, we protect their fortune and their",
      "row3": "company, and we help them plan for the future."
    },
    "item4": "We provide innovative and concluded services, based on your needs."
  },
  "services": {
    "service1": {
      "description": "Health Insurance",
      "content": {
        "dot1": "Inner hospital care in private medical clinics and public hospitals insurance.",
        "dot2": "Outer hospital care (examination and doctor services) insurance.",
        "dot3": "Dental care insurance."
      }
    },
    "service2": {
      "description": "Financial Insurance",
      "content": {
        "dot1": "Private pension.",
        "dot2": "Saving for your children's education.",
        "dot3": "Investments in Mutual Funds (low, medium and high risk)."
      }
    },
    "service3": {
      "description": "Income Insurance",
      "content": {
        "dot1": "Disability pension (caused by sickness or accident).",
        "dot2": "Income security.",
        "dot3": "Life insurance."
      }
    },
    "service4": {
      "description": "Residence Insurance",
      "content": {
        "dot1": "Main and exotic residence insurance.",
        "dot2": "Home loan insurance (also for bank contracts).",
        "dot3": "Coverage of family and pet liability.",
        "dot4": "Photovoltaics insurance."
      }
    },
    "service5": {
      "description": "Group Insurance",
      "content": {
        "dot1": "Inner and Outer hospital insurance",
        "dot2": "Pention insurance"
      }
    },
    "service6": {
      "description": "Company Insurance",
      "content": {
        "dot1": "Business insurance.",
        "dot2": "Profit loss insurance.",
        "dot3": "Coverage of civil liability.",
        "dot4": "Insurance of electronic equipment.",
        "dot5": "Product liability coverage.",
        "dot6": "Photovoltaics insurance.",
        "dot7": "Company executives insurance."
      }
    },
    "service7": {
      "description": "Credit Insurance"
    },
    "service8": {
      "description": "Civil Insurance",
      "content": {
        "dot1": "Professional Liability Coverage (Doctors, Lawyers, Accountants, Electricians, Engineers, etc.).",
        "dot2": "Business Liability Coverage (Cafes, Confectioneries, Hotels, Tutoring, Pharmacies, Hairdressers, construction of buildings, etc.)."
      }
    },
    "service9": {
      "description": "Vehicle Insurance",
      "content": {
        "dot1": "Private use Vehicle Insurance, Agricultural, Tractors, Two-wheelers etc."
      }
    },
    "service10": {
      "description": "Boat Insurance",
      "content": {
        "dot1": "Pleasure Boat, Sailing boat, Professional boat Insurance."
      }
    },
    "service11": {
      "description": "Other Insurances",
      "content": {
        "dot1": "Transport Insurance.",
        "dot2": "Travel Insurance.",
        "dot3": "Personal Data Insurance (Cyber ​​Risk)."
      }
    },
    "service12": {
      "description": "Legal Protection ARAG Insurance",
      "content": {
        "dot1": "Legal protection of the family.",
        "dot2": "Legal protection of the company and the entrepreneur.",
        "dot3": "Legal Protection of professionals (Doctors, Accountants, etc.).",
        "dot4": "Legal protection of vehicle and driver.",
        "dot5": "Legal protection of boats.",
        "dot6": "Legal Protection of real estate leasing.",
        "dot7": "Legal Protection of apartment building management.",
        "dot8": "Legal Protection of Obligations",
        "dot9": "Other: Legal protection of taxis, taxi drivers, military, police, firefighters, etc."
      }
    },
    "service13": {
      "description": "Energy Insurance",
      "content": {
        "dot1": "Mediation for the installation of photovoltaics.",
        "dot2": "Mediation for recidence or buisness electricity supply.",
        "dot3": "Mediation for residence or buisness gas supply."
      }
    }
  },
  "contact": {
    "contactUs": "Do not hesitate to contact us with any question you may have.",
    "sendMessage": "Send us a message."
  },
  "input": {
    "name": "Full Name"
  },
  "button": {
    "submit": "Send",
    "gdpr": "About your personal data."
  },
  "buttons": {
    "success": "Success",
    "error": "Error"
  },
  "utils": {
    "email_sent": "Message sent successfully.",
    "error": "Something went wrong. Try again tomorrow."
  },
  "emailform": {
    "name_missing": "Please provide a name.",
    "email_missing": "Please provide an email.",
    "email_invalid": "Please provide a valid email address.",
    "message_missing": "Please provide a message."
  },
  "footer": {
    "workhours": "Work hours",
    "monday": "Monday",
    "friday": "Friday",
    "findus": "Find us"
  },
  "announcements": {
    "1": {
      "date": "Mar 16, 2020",
      "content": "Due to Covid 19 visitors are required to wear protective masks inside our office space."
    },
    "2": {
      "date": "Feb 20, 2021",
      "content": "We stand aside our clients and we keep on providing to your needs daily, with the use of digital technology and our associates' collaborative work. We continue to offer the same high level of service in every condition."
    }
  },
  "other": {
    "location": "Andrea Papandreou 18, Kalamaria 55132 GR",
    "cellphone": "+30 6945 627619",
    "phone": "+30 2310 029126"
  },
  "gdpr": {
    "header": "The Company with the name Athanasios Efthimiou, Tax Identification Number 044254624 and registered office at Andrea Papandreou Street, no. 18, T.K. 55132, Kalamaria, informs you hereby, for the legal collection, processing and storage of data in accordance with the provisions of Articles 7 and 9 of the General Regulation on Personal Data (Γ.Κ.Π.Δ. /Ε.Ε. 679/2016).",
    "subheader": "The Company complies with the Code of Ethics of the Association of Insurance Companies of Greece for the processing personal data.",
    "first": {
      "header": "1. Purposes",
      "body": "The main purpose of the processing is the conclusion and maintenance of the insurance contract and the management of the insurance cases undertaken by the Company under it."
    },
    "second": {
      "header": "2. Source of information",
      "body": "The Company collects personal data included in the insurance application, in the accompanying its documents and supporting documents and any other data which the customer has disclosed or will notify the Company in the future, either orally or by any other means, document or electronic."
    },
    "third": {
      "header": "3. Types of data to be processed",
      "body": "The processing of data by the Company includes the following categories:\na. Identification data: first name, last name, date of birth, police ID / passport number,ΑΜΚΑ, ΑΦΜ\nb. Contact Data: email / mail address, phone / fax numbers\nc. Payment Data: bank accounts, debit / credit and other bank cards\nd. Insurance Data: Data necessary for the conclusion and management of the insurance contract, (eg in relation to financial / property situation, health data, data on driving behavior (driving history), car accident incidents, work / professional activity data)\ne. Settlement Data: Data necessary for the management of declared insurance cases, which may be included in the insurance claim, claim statement, compensation claim and accompanying their documents / supporting documents."
    },
    "fourth": {
      "header": "4. Recipients",
      "body": "My data can be transmitted: a. To other insurance companies after submitting a legal request, b. At the company's headquarters or at another company within the EU. belonging to the same group to which Company for statistical reasons, without referring to data of special categories, c. to public / judicial authorities, inside or outside the EU, d. to the Association of Insurance Companies of Greece, e. to service providers cooperating with the company, inside and outside the EU, within the framework of the legal operation of the insurance contract, such as insurance intermediaries, lawyers, researchers or experts, etc."
    },
    "fifth": {
      "header": "5. Processing time",
      "body": "The Company will collect, store and generally process data for a period of up to twenty (20) years from the expiration of the insurance contract in any way and up to five (5) years in case of non-conclusion of the insurance contract, unless a legal dispute is pending beyond the above processing times and up to its conclusion by an irrevocable court decision."
    },
    "sixth": {
      "header": "6. Data subject rights",
      "body": "The customer is informed that he has the right to withdraw his consent at any time, as well as for the consequences of any revocation. In particular, it is informed that in case the consent is revoked as to data, the processing of which is absolutely necessary for the performance of the insurance contract, the Company has the right to terminate the contract. The same may happen in case of disagreement with existing insurance policies. If the withdrawal of consent is made during the pre-contractual stage, then the Company has the right to refuse the conclusion of the contract. In addition, it is informed of the following rights, as they apply under the conditions set in the General Regulation of Personal Data (G.K.P.D./Ε.Ε. 679/2016) as well as in the respective applicable provisions relating to it, following its transposition into national law. Specifically:\n- Has the right to have access to his personal data held, owned and processed by the Company.\n- Has the right to request the correction of inaccurate or out-of-date data concerning him or the completion incomplete data.\n- It has the right to request the deletion of its data from the Company's files if their processing does not is necessary to pursue the purposes for which they have been collected.\n- It has the right to request the restriction of the use of its data in case it disputes their accuracy.\n- Has the right to receive the data he has provided in a structured, commonly used format."
    },
    "footer": "The exercise of the above-mentioned rights presupposes the submission of a written application to the Company, at the email address a.efthimiou60@gmail.com"
  }
}
