<template>
  <div class="gdpr-container">
    <div>
      <p>
        Η Εταιρία με την επωνυμία Αθανάσιος Ευθυμίου, Α.Φ.Μ. 044254624 και έδρα
        την οδό Ανδρέα Παπανδρέου, αριθ. 18, Τ.Κ. 55132, Καλαμαριά, σας
        ενημερώνει με το παρόν, για τη σύννομη συλλογή, επεξεργασία και τήρηση
        των δεδομένων σας, σύμφωνα με τις διατάξεις των άρθρων 7 και 9 του
        Γενικού Κανονισμού Προσωπικών Δεδομένων (Γ.Κ.Π.Δ. /Ε.Ε. 679/2016).
      </p>
      <p>
        Η Εταιρία τηρεί τον Κώδικα Δεοντολογίας της Ένωσης Ασφαλιστικών Εταιριών
        Ελλάδος για την επεξεργασία δεδομένων προσωπικού χαρακτήρα.
      </p>
      <p>
        1.Σκοποί <br /><br />
        Ο κύριος σκοπός της επεξεργασίας είναι η σύναψη και διατήρηση της
        ασφαλιστικής σύμβασης και η διαχείριση των ασφαλιστικών περιπτώσεων που
        αναλαμβάνει η Εταιρία δυνάμει αυτής.
      </p>
      <p>
        2. Πηγή πληροφόρησης <br /><br />Η Εταιρία συλλέγει προσωπικά δεδομένα
        που περιλαμβάνονται στην αίτηση ασφάλισης, στα συνοδευτικά αυτής έγγραφα
        και δικαιολογητικά και οποιαδήποτε άλλα δεδομένα τα οποία ο πελάτης
        γνωστοποίησε ή θα γνωστοποιήσει στην Εταιρία στο μέλλον, είτε προφορικά
        είτε με οποιοδήποτε άλλο μέσο, έγγραφο ή ηλεκτρονικό.
      </p>
      <p>
        3. Είδη δεδομένων προς επεξεργασία <br /><br />Η επεξεργασία δεδομένων
        από την Εταιρία περιλαμβάνει τις εξής κατηγορίες: α. Δεδομένα
        Ταυτοποίησης: π.χ. όνομα, επώνυμο, ημερομηνία γέννησης, αριθμό
        αστυνομικής ταυτότητας/διαβατηρίου, ΑΜΚΑ, ΑΦΜ β. Δεδομένα Επικοινωνίας:
        π.χ. διεύθυνση ηλεκτρονικού ταχυδρομείου/ αλληλογραφίας, αριθμοί
        τηλεφώνου/ φαξ γ. Δεδομένα Πληρωμής: π.χ. τραπεζικοί λογαριασμοί,
        χρεωστικές/ πιστωτικές και λοιπές τραπεζικές κάρτες δ. Δεδομένα
        Ασφάλισης: Δεδομένα απαραίτητα για τη σύναψη και διαχείριση της
        ασφαλιστικής σύμβασης, (π.χ. σε σχέση με την οικονομική/περιουσιακή
        κατάσταση, δεδομένα υγείας, δεδομένα για οδηγική συμπεριφορά (driving
        history), περιστατικά τροχαίου ατυχήματος, δεδομένα
        εργασιακά/επαγγελματικής δραστηριότητας) ε. Δεδομένα Διακανονισμού:
        Δεδομένα απαραίτητα για τη διαχείριση των ασφαλιστικών περιπτώσεων που
        δηλώνονται, τα οποία δύνανται να εμπεριέχονται στην αίτηση ασφάλισης,
        δήλωση ζημίας, αίτηση αποζημίωσης και σε συνοδευτικά αυτών
        έγγραφα/δικαιολογητικά.
      </p>
      <p>
        4. Αποδέκτες <br /><br />Δεδομένα μου μπορεί να διαβιβαστούν: α. Σε
        άλλες ασφαλιστικές εταιρίες έπειτα από υποβολή νόμιμου αιτήματος, β. Στα
        κεντρικά γραφεία της εταιρίας ή σε άλλη εταιρία εντός Ε.Ε. που ανήκει
        στον ίδιο όμιλο στον οποίο υπάγεται η Εταιρία για στατιστικούς λόγους,
        χωρίς να αφορά σε δεδομένα ειδικών κατηγοριών, δ. σε δημόσιες /
        δικαστικές αρχές, εντός ή εκτός Ε.Ε., ε. στην Ένωση Ασφαλιστικών
        Εταιριών Ελλάδος, στ. σε συνεργαζόμενους με την εταιρία παρόχους
        υπηρεσιών, εντός και εκτός Ε.Ε., στο πλαίσιο της νόμιμης λειτουργίας της
        ασφαλιστικής σύμβασης, όπως ασφαλιστικούς διαμεσολαβητές, δικηγόρους,
        ερευνητές ή πραγματογνώμονες κλπ.
      </p>

      <p>
        5. Χρόνος επεξεργασίας <br /><br />Η Εταιρία θα συλλέγει, αποθηκεύει και
        εν γένει επεξεργάζεται δεδομένα για χρονικό διάστημα μέχρι είκοσι (20)
        έτη από τη λήξη της ασφαλιστικής σύμβασης με οποιονδήποτε τρόπο και
        μέχρι πέντε (5) έτη σε περίπτωση μη σύναψης της ασφαλιστικής σύμβασης,
        εκτός εάν εκκρεμεί δικαστική διένεξη πέραν των ως άνω χρόνων
        επεξεργασίας και μέχρι την περαίωσή της με αμετάκλητη δικαστική απόφαση.
      </p>
      <p>
        6. Δικαιώματα υποκειμένου δεδομένων <br /><br />Ο πελάτης ενημερώνεται
        ότι έχει δικαίωμα να ανακαλέσει ανά πάσα στιγμή την συγκατάθεσή του,
        καθώς και για τις συνέπειες της τυχόν ανάκλησης. Ειδικότερα,
        ενημερώνεται ότι στην περίπτωση που ανακαλείται η συγκατάθεση ως προς
        δεδομένα, η επεξεργασία των οποίων είναι απολύτως αναγκαία για την
        εκτέλεση της ασφαλιστικής σύμβασης, η Εταιρία έχει το δικαίωμα να
        καταγγείλει τη σύμβαση. Το ίδιο δύναται να συμβεί σε περίπτωση μη
        συγκατάθεσης σε υφιστάμενα ασφαλιστήρια. Εάν η ανάκληση της συγκατάθεσης
        γίνει κατά το προσυμβατικό στάδιο, τότε η Εταιρία έχει το δικαίωμα να
        αρνηθεί τη σύναψη της σύμβασης. Επιπλέον, ενημερώνεται για τα παρακάτω
        δικαιώματά του, όπως αυτά ισχύουν υπό τις προϋποθέσεις που ορίζονται στο
        Γενικό Κανονισμό Προσωπικών Δεδομένων (Γ.Κ.Π.Δ. /Ε.Ε. 679/2016) καθώς
        και στις αντίστοιχες ισχύουσες διατάξεις που θα αφορούν σε αυτό, κατόπιν
        της ένταξής του στην εθνική νομοθεσία. Συγκεκριμένα: - Δικαιούται να
        έχει πρόσβαση στα προσωπικά του δεδομένα που τηρεί, διαθέτει και
        επεξεργάζεται η Εταιρία. - Δικαιούται να ζητήσει τη διόρθωση ανακριβών ή
        ανεπίκαιρων δεδομένων που τον αφορούν ή τη συμπλήρωση ελλιπών δεδομένων
        του. - Δικαιούται να ζητήσει τη διαγραφή δεδομένων του από τα αρχεία της
        Εταιρίας εφόσον η επεξεργασία τους δεν είναι απαραίτητη για την επιδίωξη
        των σκοπών για τους οποίους έχουν συλλεγεί. - Δικαιούται να ζητήσει τον
        περιορισμό της χρήσης δεδομένων του σε περίπτωση που αμφισβητεί την
        ακρίβειά τους. - Δικαιούται να λαμβάνει τα δεδομένα που έχει ο ίδιος
        παράσχει σε δομημένο, κοινώς χρησιμοποιούμενο μορφότυπο.
      </p>
      <p>
        Η άσκηση των προαναφερομένων δικαιωμάτων προϋποθέτει την υποβολή, χωρίς
        κόστος, έγγραφης αίτησης στην Εταιρία, στην ηλεκτρονική διεύθυνση
        a.efthimiou60@gmail.com
      </p>
    </div>
    <div class="hide" @click="$emit('hide')">x</div>
  </div>
</template>

<script>
export default {};
</script>

<style>
.gdpr-container {
  position: fixed;
  z-index: 10;
  height: 100%;
  top: 0;
  left: 0;
  padding: 0 10%;
  width: 100%;
  background-color: rgba(0, 0, 0, 0.5);
  overflow-y: scroll;
}

.gdpr-container div:first-child {
  background-color: var(--lblue);
  padding: 10% 5%;
  color: white;
}

.hide {
  position: fixed;
  font-weight: bold;
  color: white;
  top: 5%;
  right: 0;
  right: 5%;
  text-shadow: none;
  cursor: pointer;
  font-size: 1.2rem;
}
</style>
